yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l152c4.h
/* LCD display memory 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S016        : 1;
  unsigned char S017        : 1;
  unsigned char S018        : 1;
  unsigned char S019        : 1;
  unsigned char S020        : 1;
  unsigned char S021        : 1;
  unsigned char S022        : 1;
  unsigned char S023        : 1;
} __BITS_LCD_RAM2;
#endif
__IO_REG8_BIT(LCD_RAM2,    0x540E, __READ_WRITE, __BITS_LCD_RAM2);

/* LCD display memory 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S024        : 1;
  unsigned char S025        : 1;
  unsigned char S026        : 1;
  unsigned char S027        : 1;
  unsigned char S100        : 1;
  unsigned char S101        : 1;
  unsigned char S102        : 1;
  unsigned char S103        : 1;
} __BITS_LCD_RAM3;
#endif
__IO_REG8_BIT(LCD_RAM3,    0x540F, __READ_WRITE, __BITS_LCD_RAM3);

/* LCD display memory 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S104        : 1;
  unsigned char S105        : 1;
  unsigned char S106        : 1;
  unsigned char S107        : 1;
  unsigned char S108        : 1;
  unsigned char S109        : 1;
  unsigned char S110        : 1;
  unsigned char S111        : 1;
} __BITS_LCD_RAM4;
#endif
__IO_REG8_BIT(LCD_RAM4,    0x5410, __READ_WRITE, __BITS_LCD_RAM4);

/* LCD display memory 5 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S112        : 1;
  unsigned char S113        : 1;
  unsigned char S114        : 1;
  unsigned char S115        : 1;
  unsigned char S116        : 1;
  unsigned char S117        : 1;
  unsigned char S118        : 1;
  unsigned char S119        : 1;
} __BITS_LCD_RAM5;
#endif
__IO_REG8_BIT(LCD_RAM5,    0x5411, __READ_WRITE, __BITS_LCD_RAM5);

/* LCD display memory 6 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S120        : 1;
  unsigned char S121        : 1;
  unsigned char S122        : 1;
  unsigned char S123        : 1;
  unsigned char S124        : 1;
  unsigned char S125        : 1;
  unsigned char S126        : 1;
  unsigned char S127        : 1;
} __BITS_LCD_RAM6;
#endif
__IO_REG8_BIT(LCD_RAM6,    0x5412, __READ_WRITE, __BITS_LCD_RAM6);

/* LCD display memory 7 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S200        : 1;
  unsigned char S201        : 1;
  unsigned char S202        : 1;
  unsigned char S203        : 1;
  unsigned char S204        : 1;
  unsigned char S205        : 1;
  unsigned char S206        : 1;
  unsigned char S207        : 1;
} __BITS_LCD_RAM7;
#endif
__IO_REG8_BIT(LCD_RAM7,    0x5413, __READ_WRITE, __BITS_LCD_RAM7);

/* LCD display memory 8 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S208        : 1;
  unsigned char S209        : 1;
  unsigned char S210        : 1;
  unsigned char S211        : 1;
  unsigned char S212        : 1;
  unsigned char S213        : 1;
  unsigned char S214        : 1;
  unsigned char S215        : 1;
} __BITS_LCD_RAM8;
#endif
__IO_REG8_BIT(LCD_RAM8,    0x5414, __READ_WRITE, __BITS_LCD_RAM8);

/* LCD display memory 9 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S216        : 1;
  unsigned char S217        : 1;
  unsigned char S218        : 1;
  unsigned char S219        : 1;
  unsigned char S220        : 1;
  unsigned char S221        : 1;
  unsigned char S222        : 1;
  unsigned char S223        : 1;
} __BITS_LCD_RAM9;
#endif
__IO_REG8_BIT(LCD_RAM9,    0x5415, __READ_WRITE, __BITS_LCD_RAM9);

/* LCD display memory 10 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S224        : 1;
  unsigned char S225        : 1;
  unsigned char S226        : 1;
  unsigned char S227        : 1;
  unsigned char S300        : 1;
  unsigned char S301        : 1;
  unsigned char S302        : 1;
  unsigned char S303        : 1;
} __BITS_LCD_RAM10;
#endif
__IO_REG8_BIT(LCD_RAM10,   0x5416, __READ_WRITE, __BITS_LCD_RAM10);

/* LCD display memory 11 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S304        : 1;
  unsigned char S305        : 1;
  unsigned char S306        : 1;
  unsigned char S307        : 1;
  unsigned char S308        : 1;
  unsigned char S309        : 1;
  unsigned char S310        : 1;
  unsigned char S311        : 1;
} __BITS_LCD_RAM11;
#endif
__IO_REG8_BIT(LCD_RAM11,   0x5417, __READ_WRITE, __BITS_LCD_RAM11);

/* LCD display memory 12 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S312        : 1;
  unsigned char S313        : 1;
  unsigned char S314        : 1;
  unsigned char S315        : 1;
  unsigned char S316        : 1;
  unsigned char S317        : 1;
  unsigned char S318        : 1;
  unsigned char S319        : 1;
} __BITS_LCD_RAM12;
#endif
__IO_REG8_BIT(LCD_RAM12,   0x5418, __READ_WRITE, __BITS_LCD_RAM12);

/* LCD display memory 13 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S320        : 1;
  unsigned char S321        : 1;
  unsigned char S322        : 1;
  unsigned char S323        : 1;
  unsigned char S324        : 1;
  unsigned char S325        : 1;
  unsigned char S326        : 1;
  unsigned char S327        : 1;
} __BITS_LCD_RAM13;
#endif
__IO_REG8_BIT(LCD_RAM13,   0x5419, __READ_WRITE, __BITS_LCD_RAM13);


/*-------------------------------------------------------------------------
 *      LCD bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define LCD_CR1_B2               LCD_CR1_bit.B2
#define LCD_CR1_DUTY0            LCD_CR1_bit.DUTY0
#define LCD_CR1_DUTY1            LCD_CR1_bit.DUTY1
#define LCD_CR1_BLINKF0          LCD_CR1_bit.BLINKF0
#define LCD_CR1_BLINKF1          LCD_CR1_bit.BLINKF1
#define LCD_CR1_BLINKF2          LCD_CR1_bit.BLINKF2
#define LCD_CR1_BLINK0           LCD_CR1_bit.BLINK0
#define LCD_CR1_BLINK1           LCD_CR1_bit.BLINK1

#define LCD_CR2_VSEL             LCD_CR2_bit.VSEL
#define LCD_CR2_CC0              LCD_CR2_bit.CC0
#define LCD_CR2_CC1              LCD_CR2_bit.CC1
#define LCD_CR2_CC2              LCD_CR2_bit.CC2
#define LCD_CR2_HD               LCD_CR2_bit.HD
#define LCD_CR2_PON0             LCD_CR2_bit.PON0
#define LCD_CR2_PON1             LCD_CR2_bit.PON1
#define LCD_CR2_PON2             LCD_CR2_bit.PON2

#define LCD_CR3_DEAD0            LCD_CR3_bit.DEAD0
#define LCD_CR3_DEAD1            LCD_CR3_bit.DEAD1
#define LCD_CR3_DEAD2            LCD_CR3_bit.DEAD2
#define LCD_CR3_SOFC             LCD_CR3_bit.SOFC
#define LCD_CR3_SOF              LCD_CR3_bit.SOF
#define LCD_CR3_SOFIE            LCD_CR3_bit.SOFIE
#define LCD_CR3_LCDEN            LCD_CR3_bit.LCDEN

#define LCD_FRQ_DIV0             LCD_FRQ_bit.DIV0
#define LCD_FRQ_DIV1             LCD_FRQ_bit.DIV1
#define LCD_FRQ_DIV2             LCD_FRQ_bit.DIV2
#define LCD_FRQ_DIV3             LCD_FRQ_bit.DIV3
#define LCD_FRQ_PS0              LCD_FRQ_bit.PS0
#define LCD_FRQ_PS1              LCD_FRQ_bit.PS1
#define LCD_FRQ_PS2              LCD_FRQ_bit.PS2
#define LCD_FRQ_PS3              LCD_FRQ_bit.PS3

